iamadahn/nuttx/boards/arm/stm32/stm32f411-weact/src/stm32f411-weact-gpio.h
/* GPIO A4 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_A4_OUT)
#  define GPIO_A4_USED_OUT 1
#  define GPIO_A4_USED_INT 0
#  define GPIO_A4_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A4_INT)
#  define GPIO_A4_USED_OUT 0
#  define GPIO_A4_USED_INT 1
#  define GPIO_A4_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A4_IN)
#  define GPIO_A4_USED_OUT 0
#  define GPIO_A4_USED_INT 0
#  define GPIO_A4_USED_IN 1
#else
#  define GPIO_A4_USED_OUT 0
#  define GPIO_A4_USED_INT 0
#  define GPIO_A4_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A4_OUT_PP)
#  define GPIO_A4_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A4_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A4_OUT_CLEAR)
#  define GPIO_A4_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A4_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A4_PULL_DOWN)
#  define GPIO_A4_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_A4_PULL_FLOAT)
#  define GPIO_A4_PULL GPIO_FLOAT
#else
#  define GPIO_A4_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A4_SPEED_2MHz)
#  define GPIO_A4_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_A4_SPEED_25MHz)
#  define GPIO_A4_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A4_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A5 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_A5_OUT)
#  define GPIO_A5_USED_OUT 1
#  define GPIO_A5_USED_INT 0
#  define GPIO_A5_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A5_INT)
#  define GPIO_A5_USED_OUT 0
#  define GPIO_A5_USED_INT 1
#  define GPIO_A5_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A5_IN)
#  define GPIO_A5_USED_OUT 0
#  define GPIO_A5_USED_INT 0
#  define GPIO_A5_USED_IN 1
#else
#  define GPIO_A5_USED_OUT 0
#  define GPIO_A5_USED_INT 0
#  define GPIO_A5_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A5_OUT_PP)
#  define GPIO_A5_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A5_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A5_OUT_CLEAR)
#  define GPIO_A5_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A5_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A5_PULL_DOWN)
#  define GPIO_A5_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_A5_PULL_FLOAT)
#  define GPIO_A5_PULL GPIO_FLOAT
#else
#  define GPIO_A5_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A5_SPEED_2MHz)
#  define GPIO_A5_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_A5_SPEED_25MHz)
#  define GPIO_A5_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A5_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A6 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_A6_OUT)
#  define GPIO_A6_USED_OUT 1
#  define GPIO_A6_USED_INT 0
#  define GPIO_A6_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A6_INT)
#  define GPIO_A6_USED_OUT 0
#  define GPIO_A6_USED_INT 1
#  define GPIO_A6_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A6_IN)
#  define GPIO_A6_USED_OUT 0
#  define GPIO_A6_USED_INT 0
#  define GPIO_A6_USED_IN 1
#else
#  define GPIO_A6_USED_OUT 0
#  define GPIO_A6_USED_INT 0
#  define GPIO_A6_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A6_OUT_PP)
#  define GPIO_A6_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A6_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A6_OUT_CLEAR)
#  define GPIO_A6_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A6_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A6_PULL_DOWN)
#  define GPIO_A6_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_A6_PULL_FLOAT)
#  define GPIO_A6_PULL GPIO_FLOAT
#else
#  define GPIO_A6_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A6_SPEED_2MHz)
#  define GPIO_A6_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_A6_SPEED_25MHz)
#  define GPIO_A6_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A6_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A7 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_A7_OUT)
#  define GPIO_A7_USED_OUT 1
#  define GPIO_A7_USED_INT 0
#  define GPIO_A7_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A7_INT)
#  define GPIO_A7_USED_OUT 0
#  define GPIO_A7_USED_INT 1
#  define GPIO_A7_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A7_IN)
#  define GPIO_A7_USED_OUT 0
#  define GPIO_A7_USED_INT 0
#  define GPIO_A7_USED_IN 1
#else
#  define GPIO_A7_USED_OUT 0
#  define GPIO_A7_USED_INT 0
#  define GPIO_A7_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A7_OUT_PP)
#  define GPIO_A7_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A7_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A7_OUT_CLEAR)
#  define GPIO_A7_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A7_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A7_PULL_DOWN)
#  define GPIO_A7_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_A7_PULL_FLOAT)
#  define GPIO_A7_PULL GPIO_FLOAT
#else
#  define GPIO_A7_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A7_SPEED_2MHz)
#  define GPIO_A7_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_A7_SPEED_25MHz)
#  define GPIO_A7_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A7_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A8 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_A8_OUT)
#  define GPIO_A8_USED_OUT 1
#  define GPIO_A8_USED_INT 0
#  define GPIO_A8_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A8_INT)
#  define GPIO_A8_USED_OUT 0
#  define GPIO_A8_USED_INT 1
#  define GPIO_A8_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_A8_IN)
#  define GPIO_A8_USED_OUT 0
#  define GPIO_A8_USED_INT 0
#  define GPIO_A8_USED_IN 1
#else
#  define GPIO_A8_USED_OUT 0
#  define GPIO_A8_USED_INT 0
#  define GPIO_A8_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A8_OUT_PP)
#  define GPIO_A8_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A8_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_A8_OUT_CLEAR)
#  define GPIO_A8_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A8_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

