iamadahn/nuttx/boards/arm/stm32/stm32f411-weact/src/stm32f411-weact-gpio.h
#if defined(CONFIG_STM32F411WEACT_GPIO_B0_OUT)
#  define GPIO_B0_USED_OUT 1
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B0_INT)
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 1
#  define GPIO_B0_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B0_IN)
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 1
#else
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B0_OUT_PP)
#  define GPIO_B0_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B0_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B0_OUT_CLEAR)
#  define GPIO_B0_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B0_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B0_PULL_DOWN)
#  define GPIO_B0_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_B0_PULL_FLOAT)
#  define GPIO_B0_PULL GPIO_FLOAT
#else
#  define GPIO_B0_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B0_SPEED_2MHz)
#  define GPIO_B0_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_B0_SPEED_25MHz)
#  define GPIO_B0_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B0_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B1 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_B1_OUT)
#  define GPIO_B1_USED_OUT 1
#  define GPIO_B1_USED_INT 0
#  define GPIO_B1_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B1_INT)
#  define GPIO_B1_USED_OUT 0
#  define GPIO_B1_USED_INT 1
#  define GPIO_B1_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B1_IN)
#  define GPIO_B1_USED_OUT 0
#  define GPIO_B1_USED_INT 0
#  define GPIO_B1_USED_IN 1
#else
#  define GPIO_B1_USED_OUT 0
#  define GPIO_B1_USED_INT 0
#  define GPIO_B1_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B1_OUT_PP)
#  define GPIO_B1_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B1_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B1_OUT_CLEAR)
#  define GPIO_B1_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B1_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B1_PULL_DOWN)
#  define GPIO_B1_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_B1_PULL_FLOAT)
#  define GPIO_B1_PULL GPIO_FLOAT
#else
#  define GPIO_B1_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B1_SPEED_2MHz)
#  define GPIO_B1_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_B1_SPEED_25MHz)
#  define GPIO_B1_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B1_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B2 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_B2_OUT)
#  define GPIO_B2_USED_OUT 1
#  define GPIO_B2_USED_INT 0
#  define GPIO_B2_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B2_INT)
#  define GPIO_B2_USED_OUT 0
#  define GPIO_B2_USED_INT 1
#  define GPIO_B2_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B2_IN)
#  define GPIO_B2_USED_OUT 0
#  define GPIO_B2_USED_INT 0
#  define GPIO_B2_USED_IN 1
#else
#  define GPIO_B2_USED_OUT 0
#  define GPIO_B2_USED_INT 0
#  define GPIO_B2_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B2_OUT_PP)
#  define GPIO_B2_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B2_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B2_OUT_CLEAR)
#  define GPIO_B2_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B2_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B2_PULL_DOWN)
#  define GPIO_B2_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_B2_PULL_FLOAT)
#  define GPIO_B2_PULL GPIO_FLOAT
#else
#  define GPIO_B2_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B2_SPEED_2MHz)
#  define GPIO_B2_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_B2_SPEED_25MHz)
#  define GPIO_B2_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B2_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B3 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_B3_OUT)
#  define GPIO_B3_USED_OUT 1
#  define GPIO_B3_USED_INT 0
#  define GPIO_B3_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B3_INT)
#  define GPIO_B3_USED_OUT 0
#  define GPIO_B3_USED_INT 1
#  define GPIO_B3_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B3_IN)
#  define GPIO_B3_USED_OUT 0
#  define GPIO_B3_USED_INT 0
#  define GPIO_B3_USED_IN 1
#else
#  define GPIO_B3_USED_OUT 0
#  define GPIO_B3_USED_INT 0
#  define GPIO_B3_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B3_OUT_PP)
#  define GPIO_B3_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B3_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B3_OUT_CLEAR)
#  define GPIO_B3_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B3_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B3_PULL_DOWN)
#  define GPIO_B3_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_B3_PULL_FLOAT)
#  define GPIO_B3_PULL GPIO_FLOAT
#else
#  define GPIO_B3_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B3_SPEED_2MHz)
#  define GPIO_B3_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_B3_SPEED_25MHz)
#  define GPIO_B3_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B3_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B4 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_B4_OUT)
#  define GPIO_B4_USED_OUT 1
#  define GPIO_B4_USED_INT 0
#  define GPIO_B4_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B4_INT)
#  define GPIO_B4_USED_OUT 0
#  define GPIO_B4_USED_INT 1
#  define GPIO_B4_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_B4_IN)
#  define GPIO_B4_USED_OUT 0
#  define GPIO_B4_USED_INT 0
#  define GPIO_B4_USED_IN 1
#else
#  define GPIO_B4_USED_OUT 0
#  define GPIO_B4_USED_INT 0
#  define GPIO_B4_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B4_OUT_PP)
#  define GPIO_B4_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B4_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B4_OUT_CLEAR)
#  define GPIO_B4_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B4_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_B4_PULL_DOWN)
#  define GPIO_B4_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_B4_PULL_FLOAT)
#  define GPIO_B4_PULL GPIO_FLOAT
#else
#  define GPIO_B4_PULL GPIO_PULLUP
#endif

