iamadahn/nuttx/boards/arm/stm32/stm32f411-weact/src/stm32f411-weact-gpio.h
#if defined(CONFIG_STM32F411WEACT_GPIO_C13_PULL_DOWN)
#  define GPIO_C13_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_C13_PULL_FLOAT)
#  define GPIO_C13_PULL GPIO_FLOAT
#else
#  define GPIO_C13_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C13_SPEED_2MHz)
#  define GPIO_C13_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_C13_SPEED_25MHz)
#  define GPIO_C13_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_C13_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO C14 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_C14_OUT)
#  define GPIO_C14_USED_OUT 1
#  define GPIO_C14_USED_INT 0
#  define GPIO_C14_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_C14_INT)
#  define GPIO_C14_USED_OUT 0
#  define GPIO_C14_USED_INT 1
#  define GPIO_C14_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_C14_IN)
#  define GPIO_C14_USED_OUT 0
#  define GPIO_C14_USED_INT 0
#  define GPIO_C14_USED_IN 1
#else
#  define GPIO_C14_USED_OUT 0
#  define GPIO_C14_USED_INT 0
#  define GPIO_C14_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C14_OUT_PP)
#  define GPIO_C14_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_C14_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C14_OUT_CLEAR)
#  define GPIO_C14_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_C14_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C14_PULL_DOWN)
#  define GPIO_C14_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_C14_PULL_FLOAT)
#  define GPIO_C14_PULL GPIO_FLOAT
#else
#  define GPIO_C14_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C14_SPEED_2MHz)
#  define GPIO_C14_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_C14_SPEED_25MHz)
#  define GPIO_C14_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_C14_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO C15 Kconfig Mapping */

#if defined(CONFIG_STM32F411WEACT_GPIO_C15_OUT)
#  define GPIO_C15_USED_OUT 1
#  define GPIO_C15_USED_INT 0
#  define GPIO_C15_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_C15_INT)
#  define GPIO_C15_USED_OUT 0
#  define GPIO_C15_USED_INT 1
#  define GPIO_C15_USED_IN 0
#elif defined(CONFIG_STM32F411WEACT_GPIO_C15_IN)
#  define GPIO_C15_USED_OUT 0
#  define GPIO_C15_USED_INT 0
#  define GPIO_C15_USED_IN 1
#else
#  define GPIO_C15_USED_OUT 0
#  define GPIO_C15_USED_INT 0
#  define GPIO_C15_USED_IN 0
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C15_OUT_PP)
#  define GPIO_C15_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_C15_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C15_OUT_CLEAR)
#  define GPIO_C15_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_C15_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C15_PULL_DOWN)
#  define GPIO_C15_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411WEACT_GPIO_C15_PULL_FLOAT)
#  define GPIO_C15_PULL GPIO_FLOAT
#else
#  define GPIO_C15_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411WEACT_GPIO_C15_SPEED_2MHz)
#  define GPIO_C15_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411WEACT_GPIO_C15_SPEED_25MHz)
#  define GPIO_C15_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_C15_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO_A0 definition */

#define GPIO_A0_OUT  (GPIO_OUTPUT|GPIO_A0_OUTTYPE|GPIO_A0_OUT_DEFAULT|\
                      GPIO_A0_PULL|GPIO_A0_SPEED|GPIO_PORTA|GPIO_PIN0)
#define GPIO_A0_IN   (GPIO_INPUT|GPIO_A0_PULL|GPIO_A0_SPEED|\
                      GPIO_PORTA|GPIO_PIN0)
#define GPIO_A0_INT  (GPIO_A0_IN|GPIO_EXTI)

/* GPIO_A1 definition */

#define GPIO_A1_OUT  (GPIO_OUTPUT|GPIO_A1_OUTTYPE|GPIO_A1_OUT_DEFAULT|\
                      GPIO_A1_PULL|GPIO_A1_SPEED|GPIO_PORTA|GPIO_PIN1)
#define GPIO_A1_IN   (GPIO_INPUT|GPIO_A1_PULL|GPIO_A1_SPEED|\
                      GPIO_PORTA|GPIO_PIN1)
#define GPIO_A1_INT  (GPIO_A1_IN|GPIO_EXTI)

/* GPIO_A2 definition */

#define GPIO_A2_OUT  (GPIO_OUTPUT|GPIO_A2_OUTTYPE|GPIO_A2_OUT_DEFAULT|\
                      GPIO_A2_PULL|GPIO_A2_SPEED|GPIO_PORTA|GPIO_PIN2)
#define GPIO_A2_IN   (GPIO_INPUT|GPIO_A2_PULL|GPIO_A2_SPEED|\
                      GPIO_PORTA|GPIO_PIN2)
#define GPIO_A2_INT  (GPIO_A2_IN|GPIO_EXTI)

/* GPIO_A3 definition */

#define GPIO_A3_OUT  (GPIO_OUTPUT|GPIO_A3_OUTTYPE|GPIO_A3_OUT_DEFAULT|\
                      GPIO_A3_PULL|GPIO_A3_SPEED|GPIO_PORTA|GPIO_PIN3)
#define GPIO_A3_IN   (GPIO_INPUT|GPIO_A3_PULL|GPIO_A3_SPEED|\
                      GPIO_PORTA|GPIO_PIN3)
#define GPIO_A3_INT  (GPIO_A3_IN|GPIO_EXTI)

/* GPIO_A4 definition */

#define GPIO_A4_OUT  (GPIO_OUTPUT|GPIO_A4_OUTTYPE|GPIO_A4_OUT_DEFAULT|\
                      GPIO_A4_PULL|GPIO_A4_SPEED|GPIO_PORTA|GPIO_PIN4)
#define GPIO_A4_IN   (GPIO_INPUT|GPIO_A4_PULL|GPIO_A4_SPEED|\
                      GPIO_PORTA|GPIO_PIN4)
#define GPIO_A4_INT  (GPIO_A4_IN|GPIO_EXTI)

/* GPIO_A5 definition */

#define GPIO_A5_OUT  (GPIO_OUTPUT|GPIO_A5_OUTTYPE|GPIO_A5_OUT_DEFAULT|\
                      GPIO_A5_PULL|GPIO_A5_SPEED|GPIO_PORTA|GPIO_PIN5)
#define GPIO_A5_IN   (GPIO_INPUT|GPIO_A5_PULL|GPIO_A5_SPEED|\
                      GPIO_PORTA|GPIO_PIN5)
#define GPIO_A5_INT  (GPIO_A5_IN|GPIO_EXTI)

/* GPIO_A6 definition */

#define GPIO_A6_OUT  (GPIO_OUTPUT|GPIO_A6_OUTTYPE|GPIO_A6_OUT_DEFAULT|\
                      GPIO_A6_PULL|GPIO_A6_SPEED|GPIO_PORTA|GPIO_PIN6)
#define GPIO_A6_IN   (GPIO_INPUT|GPIO_A6_PULL|GPIO_A6_SPEED|\
                      GPIO_PORTA|GPIO_PIN6)
#define GPIO_A6_INT  (GPIO_A6_IN|GPIO_EXTI)

/* GPIO_A7 definition */

#define GPIO_A7_OUT  (GPIO_OUTPUT|GPIO_A7_OUTTYPE|GPIO_A7_OUT_DEFAULT|\
                      GPIO_A7_PULL|GPIO_A7_SPEED|GPIO_PORTA|GPIO_PIN7)
#define GPIO_A7_IN   (GPIO_INPUT|GPIO_A7_PULL|GPIO_A7_SPEED|\
                      GPIO_PORTA|GPIO_PIN7)
#define GPIO_A7_INT  (GPIO_A7_IN|GPIO_EXTI)

/* GPIO_A8 definition */

#define GPIO_A8_OUT  (GPIO_OUTPUT|GPIO_A8_OUTTYPE|GPIO_A8_OUT_DEFAULT|\
                      GPIO_A8_PULL|GPIO_A8_SPEED|GPIO_PORTA|GPIO_PIN8)
#define GPIO_A8_IN   (GPIO_INPUT|GPIO_A8_PULL|GPIO_A8_SPEED|\
                      GPIO_PORTA|GPIO_PIN8)
#define GPIO_A8_INT  (GPIO_A8_IN|GPIO_EXTI)

/* GPIO_A9 definition */

