iamadahn/nuttx/boards/arm/stm32/stm32f411-weact/src/stm32f411-weact-gpio.h
#define GPIO_A9_OUT  (GPIO_OUTPUT|GPIO_A9_OUTTYPE|GPIO_A9_OUT_DEFAULT|\
                      GPIO_A9_PULL|GPIO_A9_SPEED|GPIO_PORTA|GPIO_PIN9)
#define GPIO_A9_IN   (GPIO_INPUT|GPIO_A9_PULL|GPIO_A9_SPEED|\
                      GPIO_PORTA|GPIO_PIN9)
#define GPIO_A9_INT  (GPIO_A9_IN|GPIO_EXTI)

/* GPIO_A10 definition */

#define GPIO_A10_OUT (GPIO_OUTPUT|GPIO_A10_OUTTYPE|GPIO_A10_OUT_DEFAULT|\
                      GPIO_A10_PULL|GPIO_A10_SPEED|GPIO_PORTA|GPIO_PIN10)
#define GPIO_A10_IN  (GPIO_INPUT|GPIO_A10_PULL|GPIO_A10_SPEED|\
                      GPIO_PORTA|GPIO_PIN10)
#define GPIO_A10_INT (GPIO_A10_IN|GPIO_EXTI)

/* GPIO_A11 definition */

#define GPIO_A11_OUT (GPIO_OUTPUT|GPIO_A11_OUTTYPE|GPIO_A11_OUT_DEFAULT|\
                      GPIO_A11_PULL|GPIO_A11_SPEED|GPIO_PORTA|GPIO_PIN11)
#define GPIO_A11_IN  (GPIO_INPUT|GPIO_A11_PULL|GPIO_A11_SPEED|\
                      GPIO_PORTA|GPIO_PIN11)
#define GPIO_A11_INT (GPIO_A11_IN|GPIO_EXTI)

/* GPIO_A12 definition */

#define GPIO_A12_OUT (GPIO_OUTPUT|GPIO_A12_OUTTYPE|GPIO_A12_OUT_DEFAULT|\
                      GPIO_A12_PULL|GPIO_A12_SPEED|GPIO_PORTA|GPIO_PIN12)
#define GPIO_A12_IN  (GPIO_INPUT|GPIO_A12_PULL|GPIO_A12_SPEED|\
                      GPIO_PORTA|GPIO_PIN12)
#define GPIO_A12_INT (GPIO_A12_IN|GPIO_EXTI)

/* GPIO_A15 definition */

#define GPIO_A15_OUT (GPIO_OUTPUT|GPIO_A15_OUTTYPE|GPIO_A15_OUT_DEFAULT|\
                      GPIO_A15_PULL|GPIO_A15_SPEED|GPIO_PORTA|GPIO_PIN15)
#define GPIO_A15_IN  (GPIO_INPUT|GPIO_A15_PULL|GPIO_A15_SPEED|\
                      GPIO_PORTA|GPIO_PIN15)
#define GPIO_A15_INT (GPIO_A15_IN|GPIO_EXTI)

/* GPIO_B0 definition */

#define GPIO_B0_OUT  (GPIO_OUTPUT|GPIO_B0_OUTTYPE|GPIO_B0_OUT_DEFAULT|\
                      GPIO_B0_PULL|GPIO_B0_SPEED|GPIO_PORTB|GPIO_PIN0)
#define GPIO_B0_IN   (GPIO_INPUT|GPIO_B0_PULL|GPIO_B0_SPEED|\
                      GPIO_PORTB|GPIO_PIN0)
#define GPIO_B0_INT  (GPIO_B0_IN|GPIO_EXTI)

/* GPIO_B1 definition */

#define GPIO_B1_OUT  (GPIO_OUTPUT|GPIO_B1_OUTTYPE|GPIO_B1_OUT_DEFAULT|\
                      GPIO_B1_PULL|GPIO_B1_SPEED|GPIO_PORTB|GPIO_PIN1)
#define GPIO_B1_IN   (GPIO_INPUT|GPIO_B1_PULL|GPIO_B1_SPEED|\
                      GPIO_PORTB|GPIO_PIN1)
#define GPIO_B1_INT  (GPIO_B1_IN|GPIO_EXTI)

/* GPIO_B2 definition */

#define GPIO_B2_OUT  (GPIO_OUTPUT|GPIO_B2_OUTTYPE|GPIO_B2_OUT_DEFAULT|\
                      GPIO_B2_PULL|GPIO_B2_SPEED|GPIO_PORTB|GPIO_PIN2)
#define GPIO_B2_IN   (GPIO_INPUT|GPIO_B2_PULL|GPIO_B2_SPEED|\
                      GPIO_PORTB|GPIO_PIN2)
#define GPIO_B2_INT  (GPIO_B2_IN|GPIO_EXTI)

/* GPIO_B3 definition */

#define GPIO_B3_OUT  (GPIO_OUTPUT|GPIO_B3_OUTTYPE|GPIO_B3_OUT_DEFAULT|\
                      GPIO_B3_PULL|GPIO_B3_SPEED|GPIO_PORTB|GPIO_PIN3)
#define GPIO_B3_IN   (GPIO_INPUT|GPIO_B3_PULL|GPIO_B3_SPEED|\
                      GPIO_PORTB|GPIO_PIN3)
#define GPIO_B3_INT  (GPIO_B3_IN|GPIO_EXTI)

/* GPIO_B4 definition */

#define GPIO_B4_OUT  (GPIO_OUTPUT|GPIO_B4_OUTTYPE|GPIO_B4_OUT_DEFAULT|\
                      GPIO_B4_PULL|GPIO_B4_SPEED|GPIO_PORTB|GPIO_PIN4)
#define GPIO_B4_IN   (GPIO_INPUT|GPIO_B4_PULL|GPIO_B4_SPEED|\
                      GPIO_PORTB|GPIO_PIN4)
#define GPIO_B4_INT  (GPIO_B4_IN|GPIO_EXTI)

/* GPIO_B5 definition */

#define GPIO_B5_OUT  (GPIO_OUTPUT|GPIO_B5_OUTTYPE|GPIO_B5_OUT_DEFAULT|\
                      GPIO_B5_PULL|GPIO_B5_SPEED|GPIO_PORTB|GPIO_PIN5)
#define GPIO_B5_IN   (GPIO_INPUT|GPIO_B5_PULL|GPIO_B5_SPEED|\
                      GPIO_PORTB|GPIO_PIN5)
#define GPIO_B5_INT  (GPIO_B5_IN|GPIO_EXTI)

/* GPIO_B6 definition */

#define GPIO_B6_OUT  (GPIO_OUTPUT|GPIO_B6_OUTTYPE|GPIO_B6_OUT_DEFAULT|\
                      GPIO_B6_PULL|GPIO_B6_SPEED|GPIO_PORTB|GPIO_PIN6)
#define GPIO_B6_IN   (GPIO_INPUT|GPIO_B6_PULL|GPIO_B6_SPEED|\
                      GPIO_PORTB|GPIO_PIN6)
#define GPIO_B6_INT  (GPIO_B6_IN|GPIO_EXTI)

/* GPIO_B7 definition */

#define GPIO_B7_OUT  (GPIO_OUTPUT|GPIO_B7_OUTTYPE|GPIO_B7_OUT_DEFAULT|\
                      GPIO_B7_PULL|GPIO_B7_SPEED|GPIO_PORTB|GPIO_PIN7)
#define GPIO_B7_IN   (GPIO_INPUT|GPIO_B7_PULL|GPIO_B7_SPEED|\
                      GPIO_PORTB|GPIO_PIN7)
#define GPIO_B7_INT  (GPIO_B7_IN|GPIO_EXTI)

/* GPIO_B8 definition */

#define GPIO_B8_OUT  (GPIO_OUTPUT|GPIO_B8_OUTTYPE|GPIO_B8_OUT_DEFAULT|\
                      GPIO_B8_PULL|GPIO_B8_SPEED|GPIO_PORTB|GPIO_PIN8)
#define GPIO_B8_IN   (GPIO_INPUT|GPIO_B8_PULL|GPIO_B8_SPEED|\
                      GPIO_PORTB|GPIO_PIN8)
#define GPIO_B8_INT  (GPIO_B8_IN|GPIO_EXTI)

/* GPIO_B9 definition */

#define GPIO_B9_OUT  (GPIO_OUTPUT|GPIO_B9_OUTTYPE|GPIO_B9_OUT_DEFAULT|\
                      GPIO_B9_PULL|GPIO_B9_SPEED|GPIO_PORTB|GPIO_PIN9)
#define GPIO_B9_IN   (GPIO_INPUT|GPIO_B9_PULL|GPIO_B9_SPEED|\
                      GPIO_PORTB|GPIO_PIN9)
#define GPIO_B9_INT  (GPIO_B9_IN|GPIO_EXTI)

/* GPIO_B10 definition */

#define GPIO_B10_OUT (GPIO_OUTPUT|GPIO_B10_OUTTYPE|GPIO_B10_OUT_DEFAULT|\
                      GPIO_B10_PULL|GPIO_B10_SPEED|GPIO_PORTB|GPIO_PIN10)
#define GPIO_B10_IN  (GPIO_INPUT|GPIO_B10_PULL|GPIO_B10_SPEED|\
                      GPIO_PORTB|GPIO_PIN10)
#define GPIO_B10_INT (GPIO_B10_IN|GPIO_EXTI)

/* GPIO_B12 definition */

#define GPIO_B12_OUT (GPIO_OUTPUT|GPIO_B12_OUTTYPE|GPIO_B12_OUT_DEFAULT|\
                      GPIO_B12_PULL|GPIO_B12_SPEED|GPIO_PORTB|GPIO_PIN12)
#define GPIO_B12_IN  (GPIO_INPUT|GPIO_B12_PULL|GPIO_B12_SPEED|\
                      GPIO_PORTB|GPIO_PIN12)
#define GPIO_B12_INT (GPIO_B12_IN|GPIO_EXTI)

/* GPIO_B13 definition */

#define GPIO_B13_OUT (GPIO_OUTPUT|GPIO_B13_OUTTYPE|GPIO_B13_OUT_DEFAULT|\
                      GPIO_B13_PULL|GPIO_B13_SPEED|GPIO_PORTB|GPIO_PIN13)
#define GPIO_B13_IN  (GPIO_INPUT|GPIO_B13_PULL|GPIO_B13_SPEED|\
                      GPIO_PORTB|GPIO_PIN13)
#define GPIO_B13_INT (GPIO_B13_IN|GPIO_EXTI)

/* GPIO_B14 definition */

#define GPIO_B14_OUT (GPIO_OUTPUT|GPIO_B14_OUTTYPE|GPIO_B14_OUT_DEFAULT|\
                      GPIO_B14_PULL|GPIO_B14_SPEED|GPIO_PORTB|GPIO_PIN14)
#define GPIO_B14_IN  (GPIO_INPUT|GPIO_B14_PULL|GPIO_B14_SPEED|\
                      GPIO_PORTB|GPIO_PIN14)
#define GPIO_B14_INT (GPIO_B14_IN|GPIO_EXTI)

/* GPIO_B15 definition */

#define GPIO_B15_OUT (GPIO_OUTPUT|GPIO_B15_OUTTYPE|GPIO_B15_OUT_DEFAULT|\
                      GPIO_B15_PULL|GPIO_B15_SPEED|GPIO_PORTB|GPIO_PIN15)
#define GPIO_B15_IN  (GPIO_INPUT|GPIO_B15_PULL|GPIO_B15_SPEED|\
                      GPIO_PORTB|GPIO_PIN15)
#define GPIO_B15_INT (GPIO_B15_IN|GPIO_EXTI)

/* GPIO_C13 definition */

#define GPIO_C13_OUT (GPIO_OUTPUT|GPIO_C13_OUTTYPE|GPIO_C13_OUT_DEFAULT|\
                      GPIO_C13_PULL|GPIO_C13_SPEED|GPIO_PORTC|GPIO_PIN13)
#define GPIO_C13_IN  (GPIO_INPUT|GPIO_C13_PULL|GPIO_C13_SPEED|\
                      GPIO_PORTC|GPIO_PIN13)
#define GPIO_C13_INT (GPIO_C13_IN|GPIO_EXTI)

/* GPIO_C14 definition */

#define GPIO_C14_OUT (GPIO_OUTPUT|GPIO_C14_OUTTYPE|GPIO_C14_OUT_DEFAULT|\
                      GPIO_C14_PULL|GPIO_C14_SPEED|GPIO_PORTC|GPIO_PIN14)
#define GPIO_C14_IN  (GPIO_INPUT|GPIO_C14_PULL|GPIO_C14_SPEED|\
                      GPIO_PORTC|GPIO_PIN14)
#define GPIO_C14_INT (GPIO_C14_IN|GPIO_EXTI)

/* GPIO_C15 definition */

